class Translation(object):
    START_TEXT = """<b>لطفاً شماره تلفن تلگرام خود را با فرمت کد کشور وارد کنید.
مثال: +۹۸۹xxxxxxx</b>
"""
    AFTER_RECVD_CODE_TEXT = """<b>شماره تلفن همراه دریافت شد!
لطفاً کدی را که از تلگرام دریافت کرده‌اید ارسال کنید!</b>
"""
    BEFORE_SUCC_LOGIN = "<code>کد دریافت شد. در حال استخراج صفحه وب...</code>"
    ERRED_PAGE = """خطایی رخ داد. به صورت دستی امتحان کنید

روش گرفتن APP ID و API HASH به صورت دستی:
1. به my.telegram.org/auth بروید
2. وارد حساب تلگرام خود شوید
3. منوی API Development را کلیک کنید
4. اطلاعات را به صورت زیر وارد کنید:
• عنوان برنامه: tgbot
• نام کوتاه: tgbot
• URL: (خالی بگذارید)
• پلتفرم: دسکتاپ
5. تمام

اگر با موفقیت به صورت دستی گرفتید، لطفاً دوباره در این ربات امتحان کنید."""
    CANCELLED_MESG = "<b>خداحافظ! لطفاً /start را دوباره بزنید تا از نو شروع کنید</b>"
    IN_VALID_CODE_PVDED = "<b>کد OTP که وارد کرده‌اید نادرست است</b>"
    IN_VALID_PHNO_PVDED = "<b>شماره تلفنی که وارد کرده‌اید نادرست است، لطفاً شماره تلفن تلگرام خود را با فرمت کد کشور وارد کنید.\nمثال: +۹۸۹xxxxxxx</b>"

